netbout/netbout-rest/src/test/jmeter/post-and-read.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.3">
    <hashTree>
        <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="post &amp; read" enabled="true">
            <boolProp name="TestPlan.functional_mode">false</boolProp>
            <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
        </TestPlan>
        <hashTree>
            <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="threads" enabled="true">
                <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
                <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
                    <boolProp name="LoopController.continue_forever">false</boolProp>
                    <stringProp name="LoopController.loops">2</stringProp>
                </elementProp>
                <stringProp name="ThreadGroup.num_threads">100</stringProp>
                <stringProp name="ThreadGroup.ramp_time">5</stringProp>
            </ThreadGroup>
            <hashTree>
                <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="beanshell" enabled="true">
                    <stringProp name="BeanShellSampler.query">
                        import com.netbout.spi.Urn;
                        import com.netbout.spi.client.RestSession;
                        try {
                            home = URI.create("http://localhost:" + props.get("port"));
                            log.info("home URI: " + home);
                            user = new RestSession(home, "9OLKJ8JHGytfh6JGJF0LKF").authenticate(new Urn("urn:netbout:jmeter"), "");
                            bout = user.start();
                            bout.rename("new bout for JMeter");
                            bout.post("what's up?");
                        } catch (Throwable ex) {
                            log.error(ex.getMessage());
                            IsSuccess = false;
                        }
                    </stringProp>
                    <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
                </BeanShellSampler>
                <hashTree />
            </hashTree>
        </hashTree>
    </hashTree>
</jmeterTestPlan>